app/views/users/show.html.erb

SELECT  1 AS one FROM "nodes" WHERE "nodes"."user_id" = ? LIMIT 1  [["user_id", 1046959424]]
---
  <div class="col-md-8">
    <% if @user.nodes.any? %>