app/controllers/nodes_controller.rb

  def index
    @nodes = Node.all
---
SELECT "nodes".* FROM "nodes"

  def show
		@user = Node.find(params[:id])
---
SELECT  "nodes".* FROM "nodes" WHERE "nodes"."id" = ? LIMIT 1  [["id", 980190962]]

  def create
		tree = Node.new
		tree.createNodeTree(current_user, node_params)
---
INSERT INTO "nodes" ("content", "name", "nodetype", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["content", "MyText"], ["name", "MyText"], ["nodetype", "MyText"], ["user_id", 0], ["created_at", "2015-03-13 12:41:43.980796"], ["updated_at", "2015-03-13 12:41:43.980796"]]

  def destroy
    @node.destroy
---
DELETE FROM "nodes" WHERE "nodes"."id" = ?  [["id", 980190962]]

    def set_node
      @node = Node.find(params[:id])
---
SELECT  "nodes".* FROM "nodes" WHERE "nodes"."id" = ? LIMIT 1  [["id", 980190962]]