app/controllers/password_resets_controller.rb

UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$04$hgjTowp5MDTDwLqps0m2J.L2cBPAqyB9QKlBlqhRnVbgNoAlEz59S"], ["updated_at", "2015-03-13 10:46:34.559111"], ["id", 762146111]]
---
  def update
    if password_blank?
      flash.now[:danger] = "Password can't be blank"
      render 'edit'
    elsif @user.update_attributes(user_params)